benchmark/1000000-requests/1000-concurrent-without-dpdk/results.txt
====== SET ======
  1000000 requests completed in 20.00 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 8.223 milliseconds (cumulative count 2)
50.000% <= 19.311 milliseconds (cumulative count 500188)
75.000% <= 21.455 milliseconds (cumulative count 751025)
87.500% <= 23.375 milliseconds (cumulative count 875461)
93.750% <= 25.599 milliseconds (cumulative count 937728)
96.875% <= 27.775 milliseconds (cumulative count 968754)
98.438% <= 29.887 milliseconds (cumulative count 984444)
99.219% <= 32.559 milliseconds (cumulative count 992199)
99.609% <= 36.991 milliseconds (cumulative count 996103)
99.805% <= 42.335 milliseconds (cumulative count 998057)
99.902% <= 45.343 milliseconds (cumulative count 999033)
99.951% <= 47.519 milliseconds (cumulative count 999518)
99.976% <= 48.575 milliseconds (cumulative count 999756)
99.988% <= 49.375 milliseconds (cumulative count 999883)
99.994% <= 50.079 milliseconds (cumulative count 999943)
99.997% <= 50.495 milliseconds (cumulative count 999970)
99.998% <= 52.287 milliseconds (cumulative count 999985)
99.999% <= 52.383 milliseconds (cumulative count 999995)
100.000% <= 52.415 milliseconds (cumulative count 999998)
100.000% <= 52.447 milliseconds (cumulative count 1000000)
100.000% <= 52.447 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.015% <= 9.103 milliseconds (cumulative count 148)
0.030% <= 10.103 milliseconds (cumulative count 300)
0.060% <= 11.103 milliseconds (cumulative count 597)
0.069% <= 12.103 milliseconds (cumulative count 693)
0.075% <= 13.103 milliseconds (cumulative count 753)
0.079% <= 14.103 milliseconds (cumulative count 787)
0.578% <= 15.103 milliseconds (cumulative count 5776)
3.793% <= 16.103 milliseconds (cumulative count 37927)
17.648% <= 17.103 milliseconds (cumulative count 176481)
34.589% <= 18.111 milliseconds (cumulative count 345890)
47.186% <= 19.103 milliseconds (cumulative count 471865)
60.597% <= 20.111 milliseconds (cumulative count 605973)
71.932% <= 21.103 milliseconds (cumulative count 719321)
80.145% <= 22.111 milliseconds (cumulative count 801449)
86.230% <= 23.103 milliseconds (cumulative count 862296)
90.101% <= 24.111 milliseconds (cumulative count 901007)
92.837% <= 25.103 milliseconds (cumulative count 928365)
94.584% <= 26.111 milliseconds (cumulative count 945839)
96.057% <= 27.103 milliseconds (cumulative count 960566)
97.241% <= 28.111 milliseconds (cumulative count 972407)
98.075% <= 29.103 milliseconds (cumulative count 980747)
98.554% <= 30.111 milliseconds (cumulative count 985537)
98.910% <= 31.103 milliseconds (cumulative count 989103)
99.157% <= 32.111 milliseconds (cumulative count 991573)
99.295% <= 33.119 milliseconds (cumulative count 992950)
99.405% <= 34.111 milliseconds (cumulative count 994050)
99.502% <= 35.103 milliseconds (cumulative count 995016)
99.564% <= 36.127 milliseconds (cumulative count 995643)
99.615% <= 37.119 milliseconds (cumulative count 996153)
99.649% <= 38.111 milliseconds (cumulative count 996489)
99.683% <= 39.103 milliseconds (cumulative count 996831)
99.716% <= 40.127 milliseconds (cumulative count 997157)
99.754% <= 41.119 milliseconds (cumulative count 997538)
99.793% <= 42.111 milliseconds (cumulative count 997927)
99.839% <= 43.103 milliseconds (cumulative count 998393)
99.871% <= 44.127 milliseconds (cumulative count 998706)
99.897% <= 45.119 milliseconds (cumulative count 998972)
99.918% <= 46.111 milliseconds (cumulative count 999182)
99.939% <= 47.103 milliseconds (cumulative count 999393)
99.968% <= 48.127 milliseconds (cumulative count 999683)
99.985% <= 49.119 milliseconds (cumulative count 999852)
99.995% <= 50.111 milliseconds (cumulative count 999952)
99.997% <= 51.103 milliseconds (cumulative count 999971)
99.997% <= 52.127 milliseconds (cumulative count 999975)
100.000% <= 53.119 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 50002.50 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
       19.967     8.216    19.311    26.367    31.439    52.447
====== GET ======
  1000000 requests completed in 15.77 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 3.167 milliseconds (cumulative count 1)
50.000% <= 7.799 milliseconds (cumulative count 501142)
75.000% <= 9.071 milliseconds (cumulative count 750503)
87.500% <= 10.535 milliseconds (cumulative count 875382)
93.750% <= 12.111 milliseconds (cumulative count 937665)
96.875% <= 13.463 milliseconds (cumulative count 968774)
98.438% <= 14.983 milliseconds (cumulative count 984430)
99.219% <= 17.231 milliseconds (cumulative count 992199)
99.609% <= 19.247 milliseconds (cumulative count 996103)
99.805% <= 20.655 milliseconds (cumulative count 998048)
99.902% <= 22.751 milliseconds (cumulative count 999039)
99.951% <= 23.519 milliseconds (cumulative count 999512)
99.976% <= 24.015 milliseconds (cumulative count 999767)
99.988% <= 24.287 milliseconds (cumulative count 999885)
99.994% <= 24.447 milliseconds (cumulative count 999941)
99.997% <= 24.607 milliseconds (cumulative count 999970)
99.998% <= 24.671 milliseconds (cumulative count 999985)
99.999% <= 24.719 milliseconds (cumulative count 999993)
100.000% <= 25.727 milliseconds (cumulative count 999997)
100.000% <= 26.159 milliseconds (cumulative count 999999)
100.000% <= 26.191 milliseconds (cumulative count 1000000)
100.000% <= 26.191 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.011% <= 4.103 milliseconds (cumulative count 109)
0.047% <= 5.103 milliseconds (cumulative count 474)
10.818% <= 6.103 milliseconds (cumulative count 108183)
37.657% <= 7.103 milliseconds (cumulative count 376572)
57.801% <= 8.103 milliseconds (cumulative count 578009)
75.466% <= 9.103 milliseconds (cumulative count 754657)
84.995% <= 10.103 milliseconds (cumulative count 849950)
90.256% <= 11.103 milliseconds (cumulative count 902556)
93.741% <= 12.103 milliseconds (cumulative count 937407)
96.230% <= 13.103 milliseconds (cumulative count 962296)
97.719% <= 14.103 milliseconds (cumulative count 977194)
98.540% <= 15.103 milliseconds (cumulative count 985401)
98.940% <= 16.103 milliseconds (cumulative count 989400)
99.186% <= 17.103 milliseconds (cumulative count 991856)
99.430% <= 18.111 milliseconds (cumulative count 994305)
99.596% <= 19.103 milliseconds (cumulative count 995958)
99.723% <= 20.111 milliseconds (cumulative count 997229)
99.850% <= 21.103 milliseconds (cumulative count 998500)
99.877% <= 22.111 milliseconds (cumulative count 998774)
99.924% <= 23.103 milliseconds (cumulative count 999243)
99.982% <= 24.111 milliseconds (cumulative count 999818)
99.999% <= 25.103 milliseconds (cumulative count 999995)
100.000% <= 26.111 milliseconds (cumulative count 999998)
100.000% <= 27.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 63419.59 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        8.213     3.160     7.799    12.559    16.359    26.191