benchmark/1000000-requests/1000-concurrent-without-dpdk/results.txt
====== SET ======
  1000000 requests completed in 14.86 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.327 milliseconds (cumulative count 1)
50.000% <= 7.623 milliseconds (cumulative count 501321)
75.000% <= 8.551 milliseconds (cumulative count 751043)
87.500% <= 9.359 milliseconds (cumulative count 875641)
93.750% <= 10.319 milliseconds (cumulative count 937657)
96.875% <= 11.991 milliseconds (cumulative count 968764)
98.438% <= 13.799 milliseconds (cumulative count 984389)
99.219% <= 15.023 milliseconds (cumulative count 992188)
99.609% <= 17.039 milliseconds (cumulative count 996125)
99.805% <= 18.799 milliseconds (cumulative count 998049)
99.902% <= 22.239 milliseconds (cumulative count 999028)
99.951% <= 23.983 milliseconds (cumulative count 999519)
99.976% <= 25.167 milliseconds (cumulative count 999762)
99.988% <= 25.503 milliseconds (cumulative count 999879)
99.994% <= 25.567 milliseconds (cumulative count 999958)
99.997% <= 25.599 milliseconds (cumulative count 999972)
99.998% <= 25.647 milliseconds (cumulative count 999988)
99.999% <= 25.679 milliseconds (cumulative count 999995)
100.000% <= 25.711 milliseconds (cumulative count 999998)
100.000% <= 25.727 milliseconds (cumulative count 999999)
100.000% <= 25.743 milliseconds (cumulative count 1000000)
100.000% <= 25.743 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.007% <= 3.103 milliseconds (cumulative count 75)
0.026% <= 4.103 milliseconds (cumulative count 263)
0.098% <= 5.103 milliseconds (cumulative count 979)
6.092% <= 6.103 milliseconds (cumulative count 60924)
28.972% <= 7.103 milliseconds (cumulative count 289720)
64.822% <= 8.103 milliseconds (cumulative count 648219)
84.496% <= 9.103 milliseconds (cumulative count 844957)
92.917% <= 10.103 milliseconds (cumulative count 929168)
95.619% <= 11.103 milliseconds (cumulative count 956191)
96.974% <= 12.103 milliseconds (cumulative count 969736)
97.867% <= 13.103 milliseconds (cumulative count 978668)
98.711% <= 14.103 milliseconds (cumulative count 987112)
99.235% <= 15.103 milliseconds (cumulative count 992352)
99.455% <= 16.103 milliseconds (cumulative count 994549)
99.618% <= 17.103 milliseconds (cumulative count 996180)
99.718% <= 18.111 milliseconds (cumulative count 997180)
99.819% <= 19.103 milliseconds (cumulative count 998189)
99.834% <= 20.111 milliseconds (cumulative count 998335)
99.870% <= 21.103 milliseconds (cumulative count 998704)
99.899% <= 22.111 milliseconds (cumulative count 998987)
99.925% <= 23.103 milliseconds (cumulative count 999253)
99.961% <= 24.111 milliseconds (cumulative count 999606)
99.974% <= 25.103 milliseconds (cumulative count 999738)
100.000% <= 26.111 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 67285.70 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        7.967     2.320     7.623    10.791    14.415    25.743
====== GET ======
  1000000 requests completed in 13.59 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  multi-thread: no

Latency by percentile distribution:
0.000% <= 2.391 milliseconds (cumulative count 2)
50.000% <= 6.663 milliseconds (cumulative count 500364)
75.000% <= 7.319 milliseconds (cumulative count 750386)
87.500% <= 8.007 milliseconds (cumulative count 875167)
93.750% <= 8.767 milliseconds (cumulative count 937502)
96.875% <= 9.615 milliseconds (cumulative count 968888)
98.438% <= 10.311 milliseconds (cumulative count 984477)
99.219% <= 11.015 milliseconds (cumulative count 992199)
99.609% <= 11.783 milliseconds (cumulative count 996109)
99.805% <= 12.391 milliseconds (cumulative count 998047)
99.902% <= 12.855 milliseconds (cumulative count 999027)
99.951% <= 13.487 milliseconds (cumulative count 999513)
99.976% <= 14.175 milliseconds (cumulative count 999756)
99.988% <= 14.463 milliseconds (cumulative count 999880)
99.994% <= 14.639 milliseconds (cumulative count 999939)
99.997% <= 14.791 milliseconds (cumulative count 999974)
99.998% <= 14.855 milliseconds (cumulative count 999985)
99.999% <= 14.871 milliseconds (cumulative count 999996)
100.000% <= 14.879 milliseconds (cumulative count 999999)
100.000% <= 14.983 milliseconds (cumulative count 1000000)
100.000% <= 14.983 milliseconds (cumulative count 1000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.008% <= 3.103 milliseconds (cumulative count 84)
0.079% <= 4.103 milliseconds (cumulative count 792)
0.840% <= 5.103 milliseconds (cumulative count 8398)
26.280% <= 6.103 milliseconds (cumulative count 262805)
68.746% <= 7.103 milliseconds (cumulative count 687459)
88.530% <= 8.103 milliseconds (cumulative count 885298)
95.434% <= 9.103 milliseconds (cumulative count 954340)
98.029% <= 10.103 milliseconds (cumulative count 980294)
99.273% <= 11.103 milliseconds (cumulative count 992732)
99.730% <= 12.103 milliseconds (cumulative count 997295)
99.925% <= 13.103 milliseconds (cumulative count 999249)
99.972% <= 14.103 milliseconds (cumulative count 999723)
100.000% <= 15.103 milliseconds (cumulative count 1000000)

Summary:
  throughput summary: 73588.93 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
        6.840     2.384     6.663     9.007    10.719    14.983